// Створіть массив з назвами великих домів Вестеросу: "Старки", "Таллі", "Аррени", "Ланністери", "Баратеони", "Таргариєни", "Тирелли", "Грейджої" та виведіть їх в консоль по одному, використавши спочатку цикл `for`,
// а потім - цикл `for...of`

const homeName = [
  "Старки",
  "Таллі",
  "Аррени",
  "Ланністери",
  "Баратеони",
  "Таргариєни",
  "Тирелли",
  "Грейджої",
];

for (const name of homeName) {
  console.log(name);
}

for (let i = 0; i < homeName.length; i += 1) {
  console.log(homeName[i]);
}
